package LeetcodeAndOtherTasks;
/*"У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;"

Необходимо распечатать построчно цифру, обзначабщая кол-во букв в слове и кол-во слов с такой длиной. 
1 - 5 в тексте 5 слов с одной буквой
2 - 3 в тексте 3 слова с двумя буквами */
public class Tsak5 {
public static void main(String[] args) {
    



    

}

    
}
