package Cycles;
// Выведите в консоль все числа от 10 до −10 от бо́льшего числа к меньшему.
public class Task4 {
    public static void main(String[] args) {
         for (int i = 10; i >= -10; i--){
            System.out.print(i + " ");
        }
    }
}
